#ifndef DATS_H
#define DATS_H

#include "stdio.h"

#define CNUM 256
#define TNLENG 96

#define FOUND 1
#define NOT_FOUND 0
#define FIND_ERROR -1
#define CODEMAX 1024
#define STRING_MAX 2048

char Skl[CNUM][TNLENG] = {		
	"[End]", //0
	
	"はたく", "からてチョップ", "おうふくビンタ", "れんぞくパンチ",
	"メガトンパンチ", "ネコにこばん", "ほのおのパンチ", "れいとうパンチ" ,//8

	"かみなりパンチ", "ひっかく", "はさむ", "ハサミギロチン",
	"かまいたち", "つるぎのまい", "いあいぎり", "かぜおこし" ,//16

	"つばさでうつ", "ふきとばし", "そらをとぶ", "しめつける",
	"たたきつける", "つるのムチ", "ふみつけ", "にどげり", //24

	"メガトンキック", "とびげり", "まわしげり", "すなかけ",
	"ずつき", "つのでつく", "みだれづき", "つのドリル", //32

	"たいあたり", "のしかかり", "まきつく", "とっしん",
	"あばれる", "すてみタックル", "しっぽをふる", "どくばり", //40

	"ダブルニードル", "ミサイルばり", "にらみつける", "かみつく",
	"なきごえ", "ほえる", "うたう", "ちょうおんぱ", //48

	"ソニックブーム", "かなしばり", "ようかいえき", "ひのこ",
	"かえんほうしゃ", "しろいきり", "みずでっぽう", "ハイドロポンプ", //56

	"なみのり", "れいとうビーム", "ふぶき", "サイケこうせん",
	"バブルこうせん", "オーロラビーム", "はかいこうせん", "つつく", //64

	"ドリルくちばし", "じごくぐるま　", "けだぐり", "カウンター",
	"ちきゅうなげ", "かいりき", "すいとる", "メガドレイン", //72

	"やどりぎのタネ", "せいちょう", "はっぱカッター", "ソーラービーム",
	"どくのこな", "しびれごな", "ねむりごな", "はなびらのまい", //80

	"いとをはく", "りゅうのいかり", "ほのおのうず", "でんきショック",
	"10まんボルト", "でんじは", "かみなり", "いわおとし", //88

	"じしん", "じわれ", "あなをほる", "どくどく",
	"ねんりき", "サイコキネシス", "さいみんじゅつ", "ヨガのポーズ", //96

	"こうそくいどう", "でんこうせっか", "いかり", "テレポート",
	"ナイトヘッド", "ものまね", "いやなおと", "かげぶんしん", //104

	"じこさいせい", "かたくなる", "ちいさくなる", "えんまく",
	"あやしいひかり", "からにこもる", "まるくなる", "バリアー", //112

	"ひかりのかべ", "くろいきり", "リフレクター", "きあいだめ",
	"がまん", "ゆびをふる", "オウムがえし", "じばく", //120

	"タマゴばくだん", "したでなめる", "スモッグ", "ヘドロこうげき",
	"ホネこんぼう", "だいもんじ", "たきのぼり", "からではさむ", //128

	"スピードスター", "ロケットずつき", "とげキャノン", "からみつく",
	"ドわすれ", "スプーンまげ", "タマゴうみ", "とびひざげり", //136

	"へびにらみ", "ゆめくい", "どくガス", "たまなげ",
	"きゅうけつ", "あくまのキッス", "ゴットバード", "へんしん", //144

	"あわ", "ピヨピヨパンチ", "キノコのほうし", "フラッシュ",
	"サイコウェーブ", "はねる", "とける", "クラブハンマー", //152

	"だいばくはつ", "みだれひっかき", "ホネブーメラン", "ねむる",
	"いわなだれ", "ひっさつまえば", "かくばる", "テクスチャー", //160

	"トライアタック", "いかりのまえば", "きりさく", "みがわり",
	"わるあがき", "(N/S)", "(N/S)", "(N/S)", //168

	"(N/S)", "(N/S)", "(N/S)", "(N/S)",
	"(N/S)", "(N/S)", "(N/S)", "(N/S)", //176

	"(N/S)", "(N/S)", "(N/S)", "(N/S)",
	"(N/S)", "(N/S)", "(N/S)", "(N/S)", //184

	"(N/S)", "(N/S)", "(N/S)", "(N/S)",
	"(N/S)", "(N/S)", "(N/S)", "(N/S)", //192

	"(N/S)", "(N/S)", "(N/S)", "ひでんマシン01",
	"ひでんマシン02", "ひでんマシン03", "ひでんマシン04", "ひでんマシン05", //200

	"わざマシン01", "わざマシン02", "わざマシン03", "わざマシン04",
	"わざマシン05", "わざマシン06", "わざマシン07", "わざマシン08", //208

	"わざマシン09", "わざマシン10", "わざマシン11", "わざマシン12",
	"わざマシン13", "わざマシン14", "わざマシン15", "わざマシン16", //216

	"わざマシン17", "わざマシン18", "わざマシン19", "わざマシン20",
	"わざマシン21", "わざマシン22", "わざマシン23", "わざマシン24", //224

	"わざマシン25", "わざマシン26", "わざマシン27", "わざマシン28",
	"わざマシン29", "わざマシン30", "わざマシン31", "わざマシン32", //232

	"わざマシン33", "わざマシン34", "わざマシン35", "わざマシン36",
	"わざマシン37", "わざマシン38", "わざマシン39", "わざマシン40", //240

	"わざマシン41", "わざマシン42", "わざマシン43", "わざマシン44",
	"わざマシン45", "わざマシン46", "わざマシン47", "わざマシン48", //248

	"わざマシン49", "わざマシン50", "わざマシン51", "わざマシン52",
	"わざマシン53", "わざマシン54", "わざマシン55" //255

};

char Chl[CNUM][TNLENG] = {
	"[NULL]",				//0x00
	"イ\"", "ウ\"", "エ\"", "オ\"",
	"ガ", "ギ", "グ", "ゲ", //0x08

	"ゴ", "ザ", "ジ", "ズ",
	"ゼ", "ゾ", "ダ", "ヂ", //0x10
	
	"ヅ", "デ", "ド", "ナ\"",
	"ニ\"", "ヌ\"", "ネ\"", "ノ\"", //0x18

	"バ", "ビ", "ブ", "ボ",
	"マ\"", "ミ\"", "ム\"", "ィ\"", //0x20

	"あ\"", "い\"", "う\"", "え\"",
	"お\"", "が", "ぎ", "ぐ", //0x28

	"げ", "ご", "ざ", "じ",
	"ず", "ぜ", "ぞ", "だ", //0x30

	"ぢ", "づ", "で", "ど",
	"な\"", "に\"", "ぬ\"", "ね\"", //0x38

	"の\"", "ば", "び", "ぶ",
	"べ", "ぼ", "ま\"", "パ", //0x40

	"ピ", "プ", "ポ", "ぱ",
	"ぴ", "ぷ", "ぺ", "ぽ", //0x48

	"ま°", "み°", "[文字送り]", "[自動送り]",
	"も°", "[1行改行]", "[改行]", "[End_of_text]", //0x50

	"[文字送り]", "(主人公名)", "(ライバル名)", "ポケモン",
	"[文字送り]", "……", "[以降無効]", "[改ページ]", //0x58

	"てきの", "一時保管領域", "パソコン", "わざマシン",
	"トレーナー", "ロケットだん", "\" ", "A", //0x60

	"B", "C", "D", "E",
	"F", "G", "H", "I", //0x68

	"V", "S", "L", "M",
	"：", "ぃ", "ぅ", "「", //0x70

	"」", "『", "』", "・",
	"…", "ぁ", "ぇ", "ぉ", //0x78

	"┏", "━", "┓", "┃",
	"┗", "┛", "[空白]", "ア", //0x80

	"イ", "ウ", "エ", "オ",
	"カ", "キ", "ク", "ケ", //0x88

	"コ", "サ", "シ", "ス",
	"セ", "ソ", "タ", "チ", //0x90

	"ツ", "テ", "ト", "ナ",
	"ニ", "ヌ", "ネ", "ノ", //0x98

	"ハ", "ヒ", "フ", "ホ",
	"マ", "ミ", "ム", "メ", //0xA0

	"モ", "ヤ", "ユ", "ヨ",
	"ラ", "ル", "レ", "ロ", //0xA8

	"ワ", "ヲ", "ン", "ッ",
	"ャ", "ュ", "ョ", "ィ", //0xB0

	"あ", "い", "う", "え",
	"お", "か", "き", "く", //0xB8

	"け", "こ", "さ", "し",
	"す", "せ", "そ", "た", //0xC0

	"ち", "つ", "て", "と",
	"な", "に", "ぬ", "ね", //0xC8

	"の", "は", "ひ", "ふ",
	"へ", "ほ", "ま", "み", //0xD0

	"む", "め", "も", "や",
	"ゆ", "よ", "ら", "り", //0xD8

	"る", "れ", "ろ", "わ",
	"を", "ん", "っ", "ゃ", //0xE0

	"ゅ", "ょ", "ー", "\" ",
	"゛", "?", "!", "。", //0xE8

	"ァ", "ゥ", "ェ", "｜＞(白)",
	"｜＞(黒)", "▼", "♂", "円", //0xF0

	"Ｘ", ".", "／", "ォ",
	"♀", "0", "1", "2", //0xF8

	"3", "4", "5", "6",
	"7", "8", "9" //0xFF
};

char pNum[CNUM][TNLENG] = {
	"ィﾞゃゾ┛A",
	"サイドン", "ガルーラ", "ニドラン♂", "ピッピ",
	"オニスズメ", "ビリリダマ", "ニドキング", "ヤドラン", //0x08

	"フシギソウ", "ナッシー", "ベロリンガ", "タマタマ",
	"ベトベター", "ゲンガー", "ニドラン♀", "ニドクイン", //0x10

	"カラカラ", "サイホーン", "ラプラス", "ウィンディ",
	"ミュウ", "ギャラドス", "シェルダー", "メノクラゲ", //0x18

	"ゴース", "ストライク", "ヒトデマン", "カメックス",
	"カイロス", "モンジャラ", "けつばん", "けつばん", //0x20

	"ガーディ", "イワーク", "オニドリル", "ポッポ",
	"ヤドン", "ユンゲラー", "ゴローン", "ラッキー", //0x28

	"ゴーリキー", "バリヤード", "サワムラー", "エビワラー",
	"アーボック", "パラセクト", "コダック", "スリープ", //0x30

	"ゴローニャ", "けつばん", "ブーバー", "けつばん",
	"エレブー", "レアコイル", "ドガース", "けつばん", //0x38

	"マンキー", "パウワウ", "ディグダ", "ケンタロス",
	"けつばん", "けつばん", "けつばん", "カモネギ", //0x40

	"コンパン", "カイリュー", "けつばん", "けつばん",
	"けつばん", "ドードー", "ニョロモ", "ルージュラ", //0x48

	"ファイヤー", "フリーザー", "サンダー", "メタモン",
	"ニャース", "クラブ", "けつばん", "けつばん", //0x50

	"けつばん", "ロコン", "キュウコン", "ピカチュウ",
	"ライチュウ", "けつばん", "けつばん", "ミニリュウ", //0x58

	"ハクリュー", "カブト", "カブトプス", "タッツー",
	"シードラ", "けつばん", "けつばん", "サンド", //0x60

	"サンドパン", "オムナイト", "オムスター", "プリン",
	"プクリン", "イーブイ", "ブースター", "サンダース", //0x68

	"シャワーズ", "ワンリキー", "ズバット", "アーボ",
	"パラス", "ニョロゾ", "ニョロボン", "ビードル", //0x70

	"コクーン", "スピアー", "けつばん", "ドードリオ",
	"オコリザル", "ダグトリオ", "モルフォン", "ジュゴン", //0x78

	"けつばん", "けつばん", "キャタピー", "トランセル",
	"バタフリー", "カイリキー", "けつばん", "ゴルダック", //0x80

	"スリーパー", "ゴルバット", "ミュウツー", "カビゴン",
	"コイキング", "けつばん", "けつばん", "ベトベトン", //0x88

	"けつばん", "キングラー", "パルシェン", "けつばん",
	"マルマイン", "ピクシー", "マタドガス", "ペルシアン", //0x90

	"ゆうれい", "けつばん", "ゴースト", "ケーシィ",
	"フーディン", "ピジョン", "ピジョット", "スターミー", //0x98

	"フシギダネ", "フシギバナ", "ドククラゲ", "けつばん",
	"トサキント", "アズマオウ", "けつばん", "けつばん", //0xA0

	"けつばん", "けつばん", "ポニータ", "ギャロップ",
	"コラッタ", "ラッタ", "ニドリーノ", "ニドリーナ", //0xA8

	"イシツブテ", "ポリゴン", "プテラ", "けつばん",
	"コイル", "けつばん", "けつばん", "ヒトカゲ", //0xB0

	"ゼニガメ", "リザード", "カメール", "リザードン",
	"けつばん", "けつばん", "けつばん", "ゆうれい", //0xB8

	"ナゾノクサ", "クサイハナ", "ラフレシア", "マダツボミ",
	"ウツドン", "ウツボット", "(バグポケモン)", "(バグポケモン)", //0xC0

	"(バグポケモン)", "(バグポケモン)", "(バグポケモン)", "(バグポケモン)",
	"(バグポケモン)", "(バグポケモン)", "(バグポケモン)", "(バグポケモン)", //0xC8

	"たんパンこぞう", "むしとりのしょうねん", "ミニスカート", "ふなのり",
	"ボーイスカウト", "ガールスカウト", "かいじゅうマニア", "りかけいのおとこ", //0xD0

	"やまおとこ", "ぼうそうぞく", "かじばどろぼう", "でんきやのおやじ",
	"ジプシージャグラー", "つりびと", "かいパンやろう", "スキンヘッズ", //0xD8

	"ギャンブラー", "おとなのおねえさん", "サイキッカー", "でんきグループ",
	"ジプシージャグラー", "もうじゅうつかい", "とりつかい", "からておう", //0xE0

	"ライバル(序盤)", "オーキドせんせい", "シルフのチーフ", "はぐれけんきゅういん",
	"サカキ", "ロケットだんいん", "エリートトレーナー(男)", "エリートトレーナー(女)", //0xE8

	"シバ", "タケシ", "カスミ", "マチス",
	"エリカ", "キョウ", "カツラ", "ナツメ", //0xF0

	"ジェントルマン", "ライバル(中盤)", "ライバル(最終戦)", "カンナ",
	"きとうし", "キクコ", "ワタル", "バグトレーナー", //0xF8

	"バグトレーナー", "バグトレーナー", "バグトレーナー", "バグトレーナー",
	"バグトレーナー", "バグトレーナー", "アネﾞデパミﾞ" //0xFF
};

char Tols[CNUM][TNLENG] = {
	"[不定]",				//0x00
	"マスターボール", "ハイパーボール", "スーパーボール", "モンスターボール",
	"タウンマップ", "じてんしゃ", "?????", "サファリボール", //0x08

	"ポケモンずかん", "つきのいし", "どくけし", "やけどなおし",
	"こおりなおし", "ねむけざまし", "まひなおし", "かいふくのくすり", //0x10

	"まんたんのくすり", "すごいキズぐすり", "いいキズぐすり", "キズぐすり",
	"グレーバッジ", "ブルーバッジ", "オレンジバッジ", "レインボーバッジ", //0x18

	"ピンクバッジ", "ゴールドバッジ", "クリムゾンバッジ", "グリーンバッジ",
	"あなぬけのヒモ", "むしよけスプレー", "ひみつのコハク", "ほのおのいし", //0x20

	"かみなりのいし", "みずのいし", "マックスアップ", "タウリン",
	"ブロムヘキシン", "インドメタシン", "リゾチウム", "ふしぎなアメ", //0x28

	"こうらのカセキ", "かいのカセキ", "ひみつのカギ", "?????(ダミー)",
	"ひきかえけん", "ヨクアタール", "リーフのいし", "カードキー", //0x30

	"きんのたま", "ポイントアップ(ダミー)", "ピッピにんぎょう", "なんでもなおし",
	"げんきのかけら", "げんきのかたまり", "エフェクトガード", "シルバースプレー", //0x38

	"ゴールドスプレー", "クリティカッター", "コイン", "おいしいみず",
	"サイコソーダ", "ミックスオレ", "ふねのチケット ", "きんのいれば", //0x40

	"プラスパワー", "ディフェンダー", "スピーダー", "スペシャルアップ",
	"コインケース", "おとどけもの", "ダウジングマシン", "シルフスコープ", //0x48

	"ポケモンのふえ", "エレベーターのカギ", "がくしゅうそうち", "ボロのつりざお",
	"いいつりざお", "すごいつりざお", "ポイントアップ", "ピーピーエイド", //0x50

	"ピーピーリカバー", "ピーピーエイダー", "ピーピーマックス","ちか2かい",
	"ちか1かい", "1かい", "2かい", "3かい", //0x58

	"4かい", "5かい", "6かい", "7かい",
	"8かい", "9かい", "10かい", "11かい", //0x60

	"ちか4かい", "かみなりバッヂ", "かいがらバッヂ", "おじぞうバッヂ",
	"はやぶさバッヂ", "ひんやりバッヂ", "なかよしバッヂ", "バラバッヂ", //0x68

	"ひのたまバッヂ", "ゴールドバッヂ", "たまご", "ひよこ",
	"ブロンズ", "シルバー", "ゴールド", "プチキャプテン", //0x70

	"キャプテン", "プチマスター", "マスター", "エクセレント",
	"[空白]", "ハィあ┓ダマﾞポケモンオﾞイﾞナバ[自動送り]ヌいﾞユカあﾞぷとヅ", "やまぐち", "いしはら", //0x78

	"あﾞLとギイﾞゾジ4どみレぐガへめエﾞノﾞエﾞへオ", "がちえﾞぼゾぅよゾ[改行]ゃレ┛レぐゴゆﾞなへべ ", "てへ", "[文字送り]ポケモンビレは ",
	"[文字送り]ボボビぶは ", "[文字送り]円れにザぅボビへ[0x59][文字送り]ボビにオﾞア？円あヌ", "イﾞぴま", "ジ", //0x80

	"[空白]", "	8ゃはともﾟ89ィﾞゾぇあﾞョよひキョゥねﾞへゥ", "ノﾞギへガ", "へ＝ぼぺ4ダま8みぐノﾞ8むぐざ8めぐぼ8",
	"ヌﾞAごこだヂばこだズイﾞ△9ゴごごだオﾞ┛こ", "あﾞネふ4ぬﾞへカぅダイﾞえﾞ┛8パィﾞゴへィ", "ゾオﾞぼ8ノﾞご8", "ゾ", //0x88

	"ゾゲぼ8ノﾞヂ8たィﾞゴへお", "ゾズぼヴノﾞエﾞ89のペ┛アぇ円れにゴぅ┏ぇ", "あﾞドまなﾞたぼゲゥドまあﾞぬﾞへどのョゥぬﾞへぼ", "ぼオﾞぺノﾞエﾞぼぎぺあﾞ",
	"あﾞ", "へぅぬﾞへそエﾞへンゾへくにﾞへ2にﾞへき[文字送り]", "あﾞネﾞむぼ7ギギいﾞガィﾞ6あﾞギむぼ7ギグいﾞ", "あﾞざ[改ページ]", //0x90

	"4がわぺ4ぐふくつざポケモン4だふぅ4ぢふHぼ", "4べふあﾞ。てイﾞぐ", "へ4べへゥ┏まあﾞえﾞむギ", "へシぼゾづへぅぬﾞョゥねﾞふてポ[文字送り]ゾEへぅぬﾞ",
	"イﾞIへ", "ざんねんながら[0x4E]こうかんは　キャンセルさ", "ぜ[ライバル名]ド……4円み8ヴぐダ8エﾞぐジ8ガたぼもﾟ ", "べぐヴピみﾟぉゥハと┏ゥちと＝ゥァとゾぐへ", //0x98

	"トレードセンター[0x4E]コロシアム[0x4E]やめる", "ョゃこあﾞだとギゲゾゼへめエﾞあﾞ[0x59]とヅCわざマシンへ", "あﾞメてギエﾞゾデへめエﾞあﾞオﾞとギエﾞゾデへめエﾞ", "せんとう　アニメーション[0x4E]　じっくり　み",
	"しあいの　ルール[0x4E]　いれかえタイプ　　か", "おわり", "あﾞアロケットだん４べへ[改行]ごけぐエﾞうﾞノﾞ3┛", "ぐズガィﾞ2ョゥ", //0xA0

	"ナﾞ", "たポケモントレーナーあﾞIへイﾞギ", "ぐバあﾞ", "ゥぴまョあﾞﾞほいﾞいﾞゥIみへラGへ4べ4 ﾞ",
	"ぼチへでゾの4ぽレねへデIざにﾞ", "の4がふ8グね4おﾞふ8ヅはみﾟGぶぶノﾞピぼ", "アカサタナハマヤライキシチニヒミユリウク", "にゅうりょく", //0xA8

	"ヘデI┏ゥ ﾟほあﾞちてイﾞガヴへ・エﾞあﾞゆてヅ", "ねうﾞズノﾞ2あﾞのて4[0x5A]みヅGIレぐだヅSI", "ライバル", "のなまえは？",
	"ニックネームは？", "へ[0x59]VヅVへうV4がふレぐゾあﾞぬﾞSへブ", "ぐ♂へそエﾞへ♀べヅピ[0x59]ギオﾞへわBあﾞちIて", "ぐ▼へそエﾞへ♀べヅまﾟAギドへわBあﾞヌﾞVて", //0xB0

	"じぶんできめる[0x4E]グリーン[0x4E]シゲル[0x4E]ジョン", "じぶんできめる[0x4E]レッド[0x4E]サトシ[0x4E]ジャック", "ペゾ", "ィﾞ5ぉけぐエﾞズノﾞ.CLヅIへイﾞナﾞ",
	"グリーン", "シゲル", "ジョン", "じぶんできめる", //0xB8

	"レッド", "サトシ", "ジャック", "[空白]",
	"ヅひめあﾞム9ゾエﾞへにばリヅへめあﾞモ9ゾエ", "ヴム9て", "ヴム9て", "イﾞぴま", //0xC0

	"ジギ", "[空白]", "イﾞぴま", "ひでんマシン01",
	"ひでんマシン02", "ひでんマシン03", "ひでんマシン04", "ひでんマシン05", //0xC8

	"わざマシン01", "わざマシン02", "わざマシン03", "わざマシン04",
	"わざマシン05", "わざマシン06", "わざマシン07", "わざマシン08", //0xD0

	"わざマシン09", "わざマシン10", "わざマシン11", "わざマシン12",
	"わざマシン13", "わざマシン14", "わざマシン15", "わざマシン16", //0xD8

	"わざマシン17", "わざマシン18", "わざマシン19", "わざマシン20",
	"わざマシン21", "わざマシン22", "わざマシン23", "わざマシン24", //0xE0

	"わざマシン25", "わざマシン26", "わざマシン27", "わざマシン28",
	"わざマシン29", "わざマシン30", "わざマシン31", "わざマシン32", //0xE8

	"わざマシン33", "わざマシン34", "わざマシン35", "わざマシン36",
	"わざマシン37", "わざマシン38", "わざマシン39", "わざマシン40", //0xF0

	"わざマシン41", "わざマシン42", "わざマシン43", "わざマシン44",
	"わざマシン45", "わざマシン46", "わざマシン47", "わざマシン48", //0xF8

	"わざマシン49", "わざマシン50", "わざマシン51", "わざマシン52",
	"わざマシン53", "わざマシン54", "やめる" //0xFF
};

/*
	情報源：http://hakuda2.web.fc2.com/wario/poke1/mo.html　		　→「◆内部コード表◆」
			http://www.geocities.jp/kattempla/pokebug/mojicodep.html
			http://www.geocities.jp/kattempla/pokebug/mojicodem.html
			http://www.geocities.jp/kattempla/pokebug/pokename.html
			http://www.geocities.jp/kattempla/pokebug/itemcode2.html
	各サイトの情報を相互に参照しながら作成。
	ポケモン緑(00A　後期)以外では違う可能性がある。
*/
#endif